// !Операторы больше и меньше

// Задача 1
// Если переменная test.js больше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test > 10) {
	console.log('верно');
} else {
	console.log('не венрно'); // сработает этот вариант
}



// Задача 2
// Если переменная test.js меньше 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test < 10) {
	console.log('верно'); // 'верно'
} else {
	console.log('не верно');
}



// Задача 3
// Если переменная test.js больше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 10;
if (test >= 10) {
	console.log('верно'); // верно
} else {
	console.log('не верно');
}



// Задача 3
// Если переменная test.js больше или равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 10;
if (test >= 10) {
	console.log('верно'); // верно
} else {
	console.log('не верно');
}



// !Проверка на равенство

// Задача 5
// Если переменная test.js равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 10;
if (test == 10) {
	console.log('верно'); // верно
} else {
	console.log('не верно');
}



// !Проверка на неравенство

// Задача 6
// Если переменная test.js не равна 10, то выведите на экран слово 'верно', иначе выведите слово 'неверно'.

let test = 9;
if (test != 10) {
	console.log('верно'); // верно
} else {
	console.log('не верно');
}



// !Сравнение переменных

// Задача 7
// Даны переменные test1 и test2. Проверьте, что значение какой из этих переменных больше и выведите соответствующее сообщение на экран.

let test1 = 9;
let test2 = 10;
if (test1 > test2) {
	console.log('верно');
} else {
	console.log('не верно'); // не верно
}