/* Задача 1 
Пусть даны следующие переменные: Используя оператор ==, узнайте, равны ли значения этих переменных или нет. */

	let a = 2 * (3 - 1);
	let b = 6 - 2;
	
	console.log(a == b) // выведет true


/* Задача 2 
Пусть даны следующие переменные: Используя оператор >, узнайте, больше ли переменная a, чем b. */

	let a = 5 * (7 - 4);
	let b = 1 + 2 + 7;
	
	console.log(a > b) // выведет true


// Задача 3 Пусть даны следующие переменные: Используя операцию оператор !=, узнайте, разные ли значения этих переменных или нет.

	let a = 2 ** 4;
	let b = 4 ** 2;

console.log(a != b) // выведет false
