// Задача 1
// Создайте переменную a.Запишите в нее сумму чисел 1, 2 и 3. С помощью функции alert выведите на экран содержимое переменной a.

let a = 1 + 2 + 3; 
alert(a) //выведет 6


// Задача 2
// Выведите с помощью функции alert сумму чисел 1, 2 и 3.

alert(1 + 2 + 3) //выведет 6


// Задача 3
// Создайте переменную a со значением 10 и переменную b со значением 2. Выведите на экран их сумму, разность, произведение и частное(результат деления).

let a = 10, b = 2; 
let c = a + b; 
let d = a - b; 
let e = a * b; 
let f = a / b; 

alert(c) //выведет 12
alert(d) //выведет 8
alert(e) // выведет 20
alert(f) //выведет 5



// Задача 4 
// Создайте переменную c со значением 10 и переменную d со значением 5. Просуммируйте их, а результат присвойте переменной result.Выведите на экран значение переменной result.

let c = 10, d = 5; 
let result = c + d; 

alert(result) // выведет 15



// Задача 5
// Создайте переменную a со значением 1, переменную b со значением 2 и переменную c со значением 3. Выведите на экран их сумму.

let a = 1, b = 2, c = 3; 
let result;

alert(result = a + b + c) //выведет 6



// Задача 6
// Создайте переменную a со значением 10 и переменную b со значением 5. Отнимите от a переменную b и результат присвойте переменной c.

// Затем создайте переменную d, присвойте ей значение 7. Сложите переменные c и d, а результат запишите в переменную result.Выведите на экран значение переменной result.

let a = 10, b = 5; 
let c = a - b; 
let d = 7; 
let result = c + d; 

alert(result); //выведет 12


// Задача 7
// Не запуская код, определите, что выведется на экран:

	let a = 5 + 5 * 3;
alert(a); //выведет 20


// Задача 8
// Не запуская код, определите, что выведется на экран:

	let a = 5 + 5 * 3 + 3;
alert(a); // выведет 23



// Задача 9
// Не запуская код, определите, что выведется на экран:

	let a = 8 / 2 + 2;
alert(a); //выведет 6



// Задача 10
// Не запуская код, определите, что выведется на экран:

	let a = 8 + 2 / 2;
alert(a); // выведет 9



// Задача 11
// Не запуская код, определите, что выведется на экран:

	let a = 8 / 2 * 2;
alert(a); //выведет 8



// Задача 12
// Не запуская код, определите, что выведется на экран:

	let a = 8 * 4 / 2 / 2;
alert(a); //выведет 8



// Задача 13
// Не запуская код, определите, что выведется на экран:

	let a = (2 + 3) * (2 + 3);
alert(a); //выведет 25



// Задача 14
// Не запуская код, определите, что выведется на экран:

	let a = (2 + 3) * 2 + 3;
alert(a); //выведет 13



// Задача 15
// Не запуская код, определите, что выведется на экран:

	let a = 2 * (2 + 4 * (3 + 1));
alert(a); // выведет 36



// Задача 16
// Не запуская код, определите, что выведется на экран:

	let a = 2 * 8 / 4;
alert(a); // выведет 4



// Задача 17
// Не запуская код, определите, что выведется на экран:

	let a = (2 * 8) / 4;
alert(a); // выведет 4



// Задача 18
// Не запуская код, определите, что выведется на экран:

	let a = 2 * (8 / 4);
alert(a); //выведет 4




// Задача 19
// Запишите в переменную a число 1.5, а в переменную b - число 0.75.Найдите сумму значений этих переменных и выведите ее на экран.

let a = 1.5; 
let b = 0.75; 
let result = a + b 

alert(result) //выведет 2.25

//-----------------------------------------------------

// Задача 20
// Создайте переменную a со значением - 100. Выведите это значение на экран.

let a = -100; 

alert(a); //выведет -100

//-------------------------------------------------

// Задача 21
// Создайте переменную a, запишите в нее какое - нибудь положительное или отрицательное число.Выведите на экран это число с обратным знаком.

let a = -10; 

alert(-a) //выведет 10



// Задача 22
// Дана переменная a со значением 10 и переменная b со значением 3. Найдите остаток от деления a на b.

let a = 10, b = 3; 

alert(a % b) //выведет 1


// Задача 23
// Возведите число 2 в 10 - ю степень.Выведите результат на экран.

let a = 2 ** 10

alert(a) //выведет 1024








