/* Задача 1
Если переменная test.js равна 10, то пусть на экран выведется слово 'верно'. В противном случае пусть ничего не произойдет. */

let test = 10;

if (test == 10) {
	console.log('верно')
}



/* Задача 2
Перепишите следующий код в сокращенной форме:

if (test.js == 0) {
	alert('верно');
} else {
	alert('неверно!');
} */

if (test == 0) alert('верно'); else alert('неверно');

/* или */

if (test == 0) {
	alert('верно');

} else alert('неверно!');

/* или */

if (test == 0)
	alert('верно');

else
	
	alert('неверно!');



/* Задача 3
Перепишите следующий код в сокращенной форме:

if (test.js == 0) {
	alert('верно');
} */

if (test == 0) alert('верно');