/* Задача 1
С помощью цикла for выведите в консоль числа от 1 до 100. */

for (let i = 1; i <= 100; i++){
	console.log(i) // выведет: 1, 2, 3 ... 100
}



/* Задача 2
С помощью цикла for выведите в консоль числа от 11 до 33. */

for (let j = 11; j <= 33; j++){
	console.log(j) //выведет 11, 12, 13 ... 33
}



/* Задача 3
С помощью цикла for выведите в консоль четные числа в промежутке от 0 до 100. */

for (let k = 0; k <= 100; k += 2){
	console.log(k) //выведет: 0, 2, 4, ... 100
}



/* Задача 4
С помощью цикла for выведите в консоль нечетные числа в промежутке от 1 до 99. */

for (let r = 1; r <= 99; r += 2){
	console.log(r) // выведет: 1, 3, 5 ... 99
}



/* Задача 5
С помощью цикла for выведите в консоль числа от 100 до 0. */

for (let y = 100; y >= 0; y--){
	console.log(y) //выведет: 100, 99, 98 ... 0
}