/* Задача 1
Найдите произведение целых чисел от 1 до 20. */

let result = 1;

for (let i = 1; i <= 20; i++){
	result *= i
}
console.log(result) // выведет: 2432902008176640000; 1*1=1, 1*2=2, 2*3=6, 6*4=24, 24*5=120, 120*6=720, 720*7=5040, 5040*8=40320, 40320*9=362880, 362880*10=3628800 и т.д.



/* Задача 2
Найдите сумму четных чисел от 2 до 100. */

let sum = 0

for (let j = 2; j <= 100; j += 2){
	sum += j
}
console.log(sum) // выведет: 2550



/* Задача 3
Найдите сумму нечетных чисел от 1 до 99. */

let num = 0

for (let k = 1; k <= 99; k += 2){
	num += k
}
console.log(num) // выведет: 2500

