// Задача 1
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 == test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}



// Задача 2
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 === test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}



// Задача 3
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 == test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}



// Задача 4
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 === test2) {
	alert('верно');
} else {
	alert('неверно'); // не верно
}



// Задача 5
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = 3;

if (test1 === test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}



// !Неравенство по значению и типу

// Задача 6
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 != test2) {
	alert('верно');
} else {
	alert('неверно'); // не верно
}



// Задача 7
// Не запуская код, определите, что выведется на экран:

let test1 = '3';
let test2 = '3';

if (test1 !== test2) {
	alert('верно');
} else {
	alert('неверно'); // не верно
}



// Задача 8
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 != test2) {
	alert('верно');
} else {
	alert('неверно'); // не верно
}



// Задача 9
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = '3';

if (test1 !== test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}



// Задача 10
// Не запуская код, определите, что выведется на экран:

let test1 = 3;
let test2 = 2;

if (test1 !== test2) {
	alert('верно'); // верно
} else {
	alert('неверно');
}