/* Задача 1
Выведите в консоль числа от 1 до 100. */

let i = 1

while (i <= 100) {
	console.log(i)
	i++
}



/* Задача 2
Выведите в консоль числа от 11 до 33. */

let j = 11

while (j <= 33) {
	console.log(j)
	j++
}



/* Задача 3
Выведите в консоль четные числа в промежутке от 0 до 100. */

let k = 0

while (k <= 100) {
	console.log(k)
	k += 2
}



/* Задача 4
Выведите в консоль нечетные числа в промежутке от 1 до 99. */

let b = 1

while (b <= 99) {
	console.log(b)
	b += 2
}



/* Обратный отсчет */

/* Задача 5
Выведите в консоль числа от 30 до 0. */

let a = 30

while (a >= 0) {
	console.log(a)
	a--
}

